Can't convert Instance's Host to Work Plane. Try resetting Host to a Level.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotConvertInstHostToWorkPlane { get; }
  Visual Basic
Public Shared ReadOnly Property CannotConvertInstHostToWorkPlane As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotConvertInstHostToWorkPlane {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures FamilyFailures Class
  Autodesk.Revit.DB Namespace